chenshuang888/esp32-p4-demo1/sdkconfig.defaults
# Waveshare ESP32-P4-WIFI6-Touch-LCD-7B 板级默认配置
# 参考: esp32p4_research/ESP32-P4-WIFI6-Touch-LCD-7B/examples/ESP-IDF/*/sdkconfig.defaults
#
# 注意: 厂家示例是用 ESP-IDF 5.4.0 生成的; 本项目使用 ESP-IDF 5.4.3。
#       5.4.3 中 200MHz PSRAM 依赖 IDF_EXPERIMENTAL_FEATURES，故一并打开。

CONFIG_IDF_TARGET="esp32p4"

# ---- Flash ----
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# ---- PSRAM ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ---- Cache ----
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ---- 分区表 (自定义, 见同目录 partitions.csv) ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- IDF 5.4.3: 200MHz PSRAM 需要打开实验特性才可见 ----
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ---- LVGL ----
# LVGL 默认 LV_USE_OS = NONE（无线程安全），必须选 FreeRTOS
# LVGL 相关：main 任务里会创建界面对象，栈给足；提高 tick 精度改善刷新/动画
CONFIG_LV_OS_FREERTOS=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# 内存/字符串/格式化统一走 C 库（即 ESP-IDF 的堆），厂家 LVGL 示例同样配置
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15

# 全局默认字体。全项目代码里一处都没设过字体（都用继承），所以所有文字
# 吃的都是这一项 —— 改这里 = 全项目字号一起变。
# 18 号字体由这个 choice 自动 select 进来（Kconfig 里的 select LV_FONT_MONTSERRAT_18）。
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_18=y

# ---- USB Host（USB 摄像头 / UVC 需要）----
# 这两项是 UVC 能不能工作的**前提**，不是调优项：
#
# 1) 默认 256 太小。IDF 在 components/usb/Kconfig 里写明
#    "Device's with configuration descriptors larger than this limit cannot be supported"
#    —— UVC 设备的配置描述符（VC + VS 接口 + 格式 + 帧描述符）远超 256 字节，
#    256 会让摄像头**根本枚举不出来**。
# 2) 视频流是 IN 方向。Balanced 的 IN FIFO 只有 408 字节，Bias IN 给到 600
#    （代价是 OUT non-periodic 降到 64 字节，我们用不到 OUT）。
#
# 取值来自 demo1 的 USB 摄像头工程（同一块板实测可用）。
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
